app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @schoolclasses = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "r"], ["room_number", 0], ["created_at", "2019-01-13 17:01:11.482896"], ["updated_at", "2019-01-13 17:01:11.482896"]]
---
  def create
    @schoolclass = SchoolClass.new
    @schoolclass.title = params[:school_class_title]
    @schoolclass.room_number = params[:school_class_room_number]
    @schoolclass.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-01-14 21:59:42.184697"], ["id", 1]]
---
  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update (params.require(:school_class))