app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "a"], ["last_name", "b"], ["created_at", "2019-01-13 16:36:58.311385"], ["updated_at", "2019-01-13 16:36:58.311385"]]
---
  def create
    @student = Student.new
    @student.first_name = params[:student_first_name]
    @student.last_name = params[:student_last_name]
    @student.save